// 校验
export const regexConfig = {
	// 身份证号 匹配15位18位身份证
	idCard:
		/^[1-9]\d{5}((18|19|20)\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{3}[\dXx]|\d{2}(0[1-9]|1[0-2])(0[1-9]|[12][0-9]|3[01])\d{3})$/,
	// 手机号
	phoneNumber: /^1[3-9]\d{9}$/,
	// 邮箱
	email: /^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$/,
	// 邮编
	postalCode: /^[1-9]\d{5}(?!\d)$/,
	// 统一社会信用代码
	uscc: /^[0-9A-Z]{18}$/,
	// 账号 (大小写字母、数字)
	authAccount: /^[A-Za-z0-9]*$/,
	// 密码  密码长度 6～ 18位，必须包含字母和数字，可以包含特殊字符
	password: /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d!@#$%^&*(),.?":{}|<>]{6,18}$/,
	// 现住址、籍贯 (支持输入中文和数字)
	address: /^[\u4e00-\u9fa5\d]+$/,
};
