<script setup lang="ts">
const activeKey = ref('1');
</script>

<template>
	<a-tabs v-model:activeKey="activeKey" tab-position="left">
		<a-tab-pane key="1" tab="前 言">
			<div class="px-10">
				<h1 class="text-center font-semibold text-xl">前 言</h1>
				<p class="indent-7 leading-6 text-justify">
					高效度的《专业实训教学方案》的前提条件是高信度、高水平、高质量的职业教育的《专业人才培养方案》和《行业企业调研报告》，因此必须根据《专业人才培养方案》和《行业企业调研报告》的调研数据和结论填写《专业实训教学方案》，务必使三者做到有理有据、师出有名和相互关联。
				</p>
				<p class="indent-7 leading-6 text-justify">
					为此，必须秉持国务院《国家职业教育改革实施方案》（国发〔2019〕4号）、教育部、财政部《关于实施中国特色高水平高职学校和专业建设计划的意见》（教职成〔2019〕5号）、教育部等四部门印发《关于在院校实施“学历证书+若干职业技能等级证书”制度试点方案》（教职成〔2019〕6号）、教育部《全国职业院校教师教学创新团队建设方案》（教师函〔2019〕4号）、教育部《关于职业院校专业人才培养方案制订与实施工作的指导意见》（教职成〔2019〕13号、教育部《关于组织开展“十三五”职业教育国家规划教材建设工作的通知》（教职成司函〔2019〕94号）等政策精神，坚持“产教融合、校企合作、工学结合、行知合一”的现代职业教育治理理念，深化落实
					“从优秀到卓越”的共识。
				</p>
				<p class="indent-7 leading-6 text-justify">
					有鉴于此，必须继续深化多元协同机制，根据项目建设的周期和目标任务，依据“以项目为载体，以行动为导向，师资培训和教师行动相结合，教学实践和成果推广相结合”的原则，按照项目管理的形式，分解项目任务，重构任务清单，明确阶段性成果，并通过“线上线下相结合”的形式，密集培训各个项目承担单位的团队成员，构建“边培训，边行动；边实践，边推广”的国家职业教育虚拟仿真示范实训基地建设模式，以专业建设为龙头，以人才培养方案的建设为引领，以核心专业课程体系建设为抓手，统领各项任务并整体推进项目任务，“保质、保量；高标准、严要求”完成、完善、升华、凝练、辐射和推广各个阶段的建设成果，持续为国家职业教育虚拟仿真示范实训基地建设提供具有全国引领水准的职业教育建设方案。
				</p>
			</div>
		</a-tab-pane>
		<a-tab-pane key="2" tab="填写规范说明">
			<div class="px-10">
				<h1 class="text-center font-semibold text-xl">填写规范说明</h1>
				<p class="indent-7 leading-6 text-justify">1. 边距要求：上边距3厘米、下左右边距均为2.5厘米；</p>
				<p class="indent-7 leading-6 text-justify">
					2. 字体要求：汉字为宋体，英文和阿拉伯数字为Times New
					Roman；中文行文过程中必须使用中文的标点符号；英文行文过程中必须使用英文的标点符号；
				</p>
				<p class="indent-7 leading-6 text-justify">
					3.
					字号要求：大标题为三号粗体，一级标题为小三号粗体；二级标题为四号粗体；三级标题为小四号粗体；正文字体为小四号；图标中的字号不得小于五号；
				</p>
				<p class="indent-7 leading-6 text-justify">4. 行距要求：各级标题均为行前行后0.5行；正文的行距为固定值20磅；</p>
				<p class="indent-7 leading-6 text-justify">
					5. 图表要求：每个图表均需要编码和命名；格式为“表1-1 行动场归纳表”“图1-1
					企业分布结构图”；图号在图的下方，表号在表的上方；图表的前后均需要空一行；图表以及图表的编号均需要居中排列；正文中要及时注明图表的图号或者表号，格式为“请详见（表1-1）”；表格中的文字必须上下居中排列，表格中表头的文字必须使用粗体；
				</p>
				<p class="indent-7 leading-6 text-justify">
					6. 标题格式：
					各级标题的格式如下“一、XXXX；（二）XXXX；1.（空一格）XXXXX”；不要使用圆圈数字作为标题序号；严禁使用自动编码排列标题的序号或者表格中内容的需要；
				</p>
				<p class="indent-7 leading-6 text-justify">7. 退格要求：每行字均需要退后两个汉字；</p>
				<p class="indent-7 leading-6 text-justify">
					8.
					请仔细阅读每个栏目的填写说明；请不要删除填写要求或者填写说明，以便填写者明确填写要点，并作为审核者的评价要点。
				</p>
			</div>
		</a-tab-pane>
	</a-tabs>
</template>
